Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: The *symbol* argument determines whether *source* is compiled as a statement (``'single'``, the default) or as an :term:`expression` (``'eval'``). Any other value will cause :exc:`ValueError` to be raised.
pl: Parametr *symbol* określa czy *źródło* jest kompilowane jako wyrażenie (``'single'``, domyślnie) lub jako wyrażenie - z ang. - :term:`expression` (``'eval'``). Jakakolwiek inna wartość spowoduje, że :exc:`ValueError` zostanie zgłoszony.

source: It is possible (but not likely) that the parser stops parsing with a successful outcome before reaching the end of the source; in this case, trailing symbols may be ignored instead of causing an error. For example, a backslash followed by two newlines may be followed by arbitrary garbage. This will be fixed once the API for the parser is better.
pl: Jest możliwe (ale mało prawdopodobne) że czytnik przestanie czytać wraz z udanym wynikiem przed dotarciem do końca źródła; w takim przypadku, kończące symbole mogą zostać zignorowane zamiast powodować błąd. Dla przykładu skośnik, po którym następują dwa znaki nowego wiersza może poprzedzać dowolne śmiecie. To zostanie naprawione gdy sprzęg programowania dla czytnika zostanie ulepszony.

source: Instances of this class have :meth:`__call__` methods identical in signature to the built-in function :func:`compile`, but with the difference that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
pl: Przykłady tego uogólnienia mają sposób postępowania :meth:`__call__` identyczny z sygnaturą do wbudowanego zadania :func:`compile`, ale z tą różnicą, że jeśli przykład kompiluje tekst programu zawierający wyrażenia :mod:`__future__`, przykład 'zapamiętuje' i kompiluje wszystkie następujące potem teksty programu z tym wyrażeniem w mocy.

source: Instances of this class have :meth:`__call__` methods identical in signature to :func:`compile_command`; the difference is that if the instance compiles program text containing a ``__future__`` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
pl: Przykłady tego uogólnienia mają sposoby postępowania :meth:`__call__` identyczne z sygnaturą dla :func:`compile_command`; Różnica polega na tym, że jeśli przykład kompiluje tekst programu zawierający wyrażenie ``__future__``, przykład 'pamięta' i kompiluje wszystkie następujące później teksty programu z wyrażeniem w mocy.

source: :mod:`collections` --- Container datatypes
pl: :mod:`collections` --- typy danych kontenerów

source: This module implements high-performance container datatypes. Currently, there are four datatypes, :class:`Counter`, :class:`deque`, :class:`OrderedDict` and :class:`defaultdict`, and one datatype factory function, :func:`namedtuple`.
pl: Ten moduł wypełnia wysokiej-wydajności typy danych kontenerów. Obecnie są cztery typy danych. :class:`Counter`, :class:`deque`, :class:`OrderedDict` i :class:`defaultdict`, i jeden typ danych zadania fabrykującego, :func:`namedtuple`.

source: The specialized containers provided in this module provide alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
pl: Specjalizowane kontenery dostarczane w tym module dostarczają alternatywy dla kontenerów ogólnego zastosowania języka pytonowskiego, :class:`dict`, :class:`list`, :class:`set` i :class:`tuple`.

source: In addition to containers, the collections module provides some ABCs (abstract base classes) that can be used to test whether a class provides a particular interface, for example, whether it is hashable or a mapping.
pl: W dodatku względem kontenerów, moduł kolekcji dostarcza pewnych ABCów (abstrakcyjnych uogólnień podstawowych) które mogą być użyte do przetestowania czy uogólnienie dostarcza konkretny sprzęg, dla przykładu, czy jest to typ haszowalny czy mapowalny.

source: ABCs - abstract base classes
pl: ABCe - abstrakcyjne uogólnienia podstawowe

source: The collections module offers the following ABCs:
pl: Moduł kolekcji oferuje następujące abstrakcyjne uogólnienia podstawowe:

source: Inherits
pl: Dziedziczy

source: Abstract Methods
pl: Abstrakcyjne sposoby postępowania

source: Mixin Methods
pl: Domieszkowe sposoby postępowania

source: :class:`Container`
pl: :class:`Container` - kontener

source: ``__contains__``. ``__iter__``, ``__reversed__``. ``index``, and ``count``
pl: ``__contains__``. ``__iter__``, ``__reversed__``. ``index``, i ``count``

source: Inherited Sequence methods and ``append``, ``reverse``, ``extend``, ``pop``, ``remove``, and ``__iadd__``
pl: Odziedziczone sposoby postępowania sekwencji ``append``, ``reverse``, ``extend``, ``pop``, ``remove``, i ``__iadd__``

source: ``__le__``, ``__lt__``, ``__eq__``, ``__ne__``, ``__gt__``, ``__ge__``, ``__and__``, ``__or__`` ``__sub__``, ``__xor__``, and ``isdisjoint``
pl: ``__le__``, ``__lt__``, ``__eq__``, ``__ne__``, ``__gt__``, ``__ge__``, ``__and__``, ``__or__`` ``__sub__``, ``__xor__``, i ``isdisjoint``

source: :class:`MutableSet`
pl: :class:`MutableSet` - mutowalny zbiór

source: ``add`` and ``discard``
pl: ``dodaj`` i ``odrzuć`` - z ang. - ``add`` i ``discard``

source: Inherited Set methods and ``clear``, ``pop``, ``remove``, ``__ior__``, ``__iand__``, ``__ixor__``, and ``__isub__``
pl: Odziedziczone sposoby postępowania Zbioru i ``clear``, ``pop``, ``remove``, ``__ior__``, ``__iand__``, ``__ixor__``, i ``__isub__``

source: :class:`Mapping`
pl: :class:`Mapping` - z ang. - Mapowanie

source: ``__contains__``, ``keys``, ``items``, ``values``, ``get``, ``__eq__``, and ``__ne__``
pl: ``__contains__``, ``keys``, ``items``, ``values``, ``get``, ``__eq__``, i ``__ne__``

source: :class:`MutableMapping`
pl: :class:`MutableMapping` - mutowalne mapowanie

source: ``__setitem__`` and ``__delitem__``
pl: ``__setitem__`` i ``__delitem__``

source: Inherited Mapping methods and ``pop``, ``popitem``, ``clear``, ``update``, and ``setdefault``
pl: Odziedziczone sposoby postępowania Mapowania i ``pop``, ``popitem``, ``clear``, ``update``, i ``setdefault``

source: :class:`MappingView`
pl: :class:`MappingView` - Widok mapowania

source: These ABCs allow us to ask classes or instances if they provide particular functionality, for example::
pl: Te ABC-e - abstrakcyjne uogólnienia podstawowe pozwalają nam zapytać uogólnienia lub ich przykłady czy dostarczają konkretnej funkcjonalności, na przykład::

source: Several of the ABCs are also useful as mixins that make it easier to develop classes supporting container APIs. For example, to write a class supporting the full :class:`Set` API, it only necessary to supply the three underlying abstract methods: :meth:`__contains__`, :meth:`__iter__`, and :meth:`__len__`. The ABC supplies the remaining methods such as :meth:`__and__` and :meth:`isdisjoint` ::
pl: Kilka z ABC-ów są także użyteczne jako domieszki które ułatwiają rozwijanie uogólnień wspierających sprzęgi programowania kontenerów (z ang. - APIs). Dla przykładu aby zapisać uogólnienie wspierające w pełni sprzęg :class:`Set` - z ang. - zbioru, jest tylko konieczne dostarczenie trzech leżących u podstaw abstrakcyjnych sposobów postępowania: :meth:`__contains__`, :meth:`__iter__`, i :meth:`__len__`. ABCe dostarczają pozostałe metody takie jak :meth:`__and__` i :meth:`isdisjoint`::

source: class ListBasedSet(collections.Set): ''' Alternate set implementation favoring space over speed and not requiring the set elements to be hashable. ''' def __init__(self, iterable): self.elements = lst = [] for value in iterable: if value not in lst: lst.append(value) def __iter__(self): return iter(self.elements) def __contains__(self, value): return value in self.elements def __len__(self): return len(self.elements) s1 = ListBasedSet('abcdef') s2 = ListBasedSet('defghi') overlap = s1 & s2 # The __and__() method is supported automatically
pl: class ListBasedSet(collections.Set): ''' Alternatywne wypełnienie zbiorów preferujące rozmiar ponad prędkością działania i nie wymagające od elementów zbioru aby były hashowalne. ''' def __init__(self, iterable): self.elements = lst = [] for value in iterable: if value not in lst: lst.append(value) def __iter__(self): return iter(self.elements) def __contains__(self, value): return value in self.ements def __len__(self): return len(self.elements) s1 = ListBasedSet('abcdef') s2 = ListBasedSet('defghi') overlap = s1 & s2 # Sposób postępowania __and__() jest wspierany automatycznie

source: Notes on using :class:`Set` and :class:`MutableSet` as a mixin:
pl: Uwagi o używaniu :class:`Set` i :class:`MutableSet` jako domieszki:

source: Since some set operations create new sets, the default mixin methods need a way to create new instances from an iterable. The class constructor is assumed to have a signature in the form ``ClassName(iterable)``. That assumption is factored-out to an internal classmethod called :meth:`_from_iterable` which calls ``cls(iterable)`` to produce a new set. If the :class:`Set` mixin is being used in a class with a different constructor signature, you will need to override :meth:`from_iterable` with a classmethod that can construct new instances from an iterable argument.
pl: Od kiedy niektóre operacje zbiorów tworzą nowe zbiory, domyślne sposoby postępowania domieszek potrzebują sposobu aby tworzyć nowe przykłady z iterowalnego. Konstruktor uogólnienia jest przyjmowany że ma sygnaturę w postaci ``ClassName(iterable)``. To założenie jest wyciągnięte na zewnątrz do wewnętrznego sposobu postępowania uogólnienia zwanego :meth:`_from_iterable` które wywołuje ``cls(iterable)`` aby wytworzyć nowy zbiór. Jeśli domieszka uogólnienie zbioru :class:`Set` jest używana w uogólnieniu z różną sygnaturą konstruktora, będziesz potrzebował przesłonić :meth:`from_iterable` za pomocą sposobu postępowania uogólnienia, który może skonstruować nowe przykłady z iterowalnego parametru.

source: To override the comparisons (presumably for speed, as the semantics are fixed), redefine :meth:`__le__` and then the other operations will automatically follow suit.
pl: Aby przesłonić porównania (zakładając dla prędkości, jako że składnia jest poprawiona), ponownie zdefiniuj :meth:`__le__` i wtedy inne operacje automatycznie postąpią za nią.

source: The :class:`Set` mixin provides a :meth:`_hash` method to compute a hash value for the set; however, :meth:`__hash__` is not defined because not all sets are hashable or immutable. To add set hashabilty using mixins, inherit from both :meth:`Set` and :meth:`Hashable`, then define ``__hash__ = Set._hash``.
pl: Domieszka :class:`Set` dostarcza sposób postępowania :meth:`_hash` aby obliczyć wartość hash dla zbioru; jednakże :meth:`__hash__` nie jest zdefiniowana ponieważ nie wszystkie zbiory są hashowalne lub niemutowalne. Aby dodać hashowalność używając domieszek, odziedzicz z obydwu :meth:`Set` i :meth:`Hashable`, i zdefiniuj ``__hash__ = Set._hash``.

source: `OrderedSet recipe <http://code.activestate.com/recipes/576694/>`_ for an example built on :class:`MutableSet`.
pl: `OrderedSet przepis <http://code.activestate.com/recipes/576694/>`_ dla przykładu zbudowany na :class:`MutableSet`.

source: For more about ABCs, see the :mod:`abc` module and :pep:`3119`.
pl: Po więcej o ABC-ach, sięgnij do modułu :mod:`abc` i :pep:`3119`.

source: :class:`Counter` objects
pl: przedmioty :class`Counter`

source: A counter tool is provided to support convenient and rapid tallies. For example::
pl: narzędzie licznika jest dostarczone dla wsparcia wygodnych i szybkich rejestrów. Dla przykładu::

source: >>> # Tally occurrences of words in a list >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Find the ten most common words in Hamlet >>> import re >>> words = re.findall('\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]
pl: >>> # Rejestr wystąpień słowa w liście >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Znajdź dziesięć najpopularniejszych słów w Hamlecie >>> import re >>> words = re.findall('\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]

source: A :class:`Counter` is a :class:`dict` subclass for counting hashable objects. It is an unordered collection where elements are stored as dictionary keys and their counts are stored as dictionary values. Counts are allowed to be any integer value including zero or negative counts. The :class:`Counter` class is similar to bags or multisets in other languages.
pl: Uogólnienie :class:`Counter` jest podrzędnym uogólnieniem uogólnienia :class:`dict` do zliczania przedmiotów hashowalnych. Jest to nieuporządkowana kolekcja gdzie elementy są zachowane jako klucze słownika a ich liczby powtórzeń są przechowywane jako wartości słownika. Zliczone wartości mogą być wartościami całkowitymi zawierającymi zero i wartości ujemne. Uogólnienie :class:`Counter` jest podobne do torebek lub wielozbiorów w innych językach.

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
pl: Elementy są zliczane z *iterowalnego* lub inicjowane z innego *mapowania* (lub zliczania):

source: >>> c = Counter() # a new, empty counter >>> c = Counter('gallahad') # a new counter from an iterable >>> c = Counter({'red': 4, 'blue': 2}) # a new counter from a mapping >>> c = Counter(cats=4, dogs=8) # a new counter from keyword args
pl: >>> c = Counter() # nowy, pusty licznik >>> c = Counter('gallahad') # nowy licznik z iterowalnego >>> c = Counter({'red': 4, 'blue': 2}) # nowy licznik z mapowania >>> c = Counter(cats=4, dogs=8) # nowy licznik z parametrów słów kluczowych

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
pl: Przedmioty Licznika mają sprzęg słownika z wyjątkiem że mogą zwracać liczbę zero dla brakujących elementów zamiast zgłaszania błędu :exc:`KeyError`:

source: >>> c = Counter(['eggs', 'ham']) >>> c['bacon'] # count of a missing element is zero 0
pl: >>> c = Counter(['eggs', 'ham']) >>> c['bacon'] # liczba dla brakującego elementu jest zero 0

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
pl: Ustawienie liczby zliczonej na zero nie usuwa elementu z licznika. Użyj ``del`` aby usunąć je całkowicie.

source: >>> c['sausage'] = 0 # counter entry with a zero count >>> del c['sausage'] # del actually removes the entry
pl: >>> c['sausage'] = 0 # wpis licznika z liczbą zero >>> del c['sausage'] # del właściwie usuwa wpis

source: Counter objects support three methods beyond those available for all dictionaries:
pl: Przedmioty licznika wspierają trzy sposoby postępowania poza tymi dostępnymi dla wszystkich słowników:

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in arbitrary order. If an element's count is less than one, :meth:`elements` will ignore it.
pl: Zwróć iterator ponad elementami powtarzając każdy tyle razy jak jego liczba. Elementy są zwracane w dowolny sposób. Jeśli liczba elementu jest mniejsza niż jeden sposób postępowania :meth:`elements` zignoruje ją.

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is not specified, :func:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered arbitrarily:
pl: Zwróć listę *n* najczęstszych elementów i ich liczb od najczęstszego do najmniej częstego. Jeśli *n* nie jest określony, :func:`most_common` zwraca *all* - z ang. - *wszystkie* elementy w liczniku. Elementy z równymi liczbami są uszeregowane dowolnie:

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
pl: Elementy są odejmowane z *iterowalnego* lub z innego *mapowania* (lub licznika). Jak :meth:`dict.update` ale odejmuje liczby zamiast je zastępować. Zarówno wejścia jak i wyjścia mogą być zerowe lub ujemne.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
pl: Typowe sposoby postępowania są dostępne dla przedmiotów :class:`Counter` z wyjątkiem dwóch które działają inaczej dla liczników.

source: This class method is not implemented for :class:`Counter` objects.
pl: Ten sposób postępowania nie jest wypełniony dla przedmiotów :class:`Counter`.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
pl: Elementy są zliczane z *iterowalnego* lub dodanej z innego *mapowania* lub licznika. Jak :meth:`dict.update` ale dodaje liczby zamiast zamieniać je. Także oczekuje się, że *iterowalny* będzie sekwencją elementów, nie sekwencją par ``(klucz, wartość)``

source: Common patterns for working with :class:`Counter` objects::
pl: Wspólne wzorce dla pracy z przedmiotami :class:`Counter`::

source: sum(c.values()) # total of all counts c.clear() # reset all counts list(c) # list unique elements set(c) # convert to a set dict(c) # convert to a regular dictionary c.items() # convert to a list of (elem, cnt) pairs Counter(dict(list_of_pairs)) # convert from a list of (elem, cnt) pairs c.most_common()[:-n:-1] # n least common elements c += Counter() # remove zero and negative counts
pl: sum(c.values()) # suma wszystkich liczb c.clear() # resetuj wszystkie liczby list(c) # listuj niepowtarzalne elementy set(c) # zamień na zbiór dict(c) # zamień na regularny słownik c.items() # zamień na listę par (elem, cnt) Counter(dict(list_of_pairs)) # zamień z listy par (elem, cnt) c.most_common()[:-n:-1] # n najrzadszych elementów c += Counter() # usuń zerowe i ujemne liczby

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
pl: Kilka matematycznych operacji jest dostępnych dla łączenia przedmiotów :class:`Counter` aby stworzyć wielozbiory (liczniki które mają liczby większe niż zero). Dodawanie i odejmowanie łączą liczniki przez dodawanie i odejmowanie liczb odpowiadających elementów. Przecięcie i suma zwracają minimalne i maksymalne wartości odpowiadających sobie liczb. Każda operacja może akceptować wejście z liczbami ze znakiem, ale wyjście będzie odrzucało wyniki z liczbami mniejszymi lub równymi zero.

source: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # add two counters together: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # subtract (keeping only positive counts) Counter({'a': 2}) >>> c & d # intersection: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # union: max(c[x], d[x]) Counter({'a': 3, 'b': 2})
pl: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # dodaj dwa liczniki razem: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # odejmij (zatrzymując tylko dodatnie liczby) Counter({'a': 2}) >>> c & d # przecięcie: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # suma: max(c[x], d[x]) Counter({'a': 3, 'b': 2})

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
pl: Liczniki są przede wszystkim zaprojektowane do pracy z dodatnimi liczbami całkowitymi aby reprezentować bieżące liczby; jednakże, zatroszczono się aby bez potrzeby nie wykluczyć przypadków użycia wymagających innego typu ujemnych wartości. Aby pomóc w tych przypadkach, ten rozdział dokumentuje obostrzenia minimalnego zakresu i typu.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
pl: Uogólnienie :class:`Counter` samo w sobie jest podrzędnym uogólnieniem słownika bez ograniczeń co do kluczy i wartości. Wartości są przeznaczone aby były liczbami reprezentującymi wartości zliczane, ale *możesz* wpisać cokolwiek do pola wartości.

source: The :meth:`most_common` method requires only that the values be orderable.
pl: Sposób postępowania :meth:`most_common` - z ang. - 'najczęstszy' - wymaga jedynie aby wartości były możliwe do uporządkowania.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`update` and :meth:`subtract` which allow negative and zero values for both inputs and outputs.
pl: Dla operacji w miejscu takich jak ``c[klucz] += 1``, typ wartości wymaga tylko wsparcia dla dodawania i odejmowania. Więc ułamki, liczby zmiennoprzecinkowe i dziesiątkowe będą działać i wartości ujemne są wspierane. To samo jest także prawdziwe dla :meth:`update` i :meth:`subtract` które pozwalają na wartości ujemne i zerowe dla zarówno wejść jak i wyjść.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support support addition, subtraction, and comparison.
pl: Sposoby postępowania wielozbiorów są zaprojektowane tylko dla przypadków użycia wartości dodatnich. Wejścia mogą być ujemne lub zerowe, ale tylko wyjścia z dodatnimi wartościami są tworzone. Nie ma ograniczeń typu, ale wartość musi wspierać dodawanie odejmowanie i porównania.

source: The :meth:`elements` method requires integer counts. It ignores zero and negative counts.
pl: Sposób postępowania :meth:`elements` wymaga liczb całkowitych do zliczania. Ignoruje zerowe i ujemne liczby.

source: `Counter class <http://code.activestate.com/recipes/576611/>`_ adapted for Python 2.5 and an early `Bag recipe <http://code.activestate.com/recipes/259174/>`_ for Python 2.4.
pl: `Uogólnienie licznika <http://code.activestate.com/recipes/576611/>`_ zaadaptowane dla języka pytonowskiego 2.5 i wczesna recepta na `Torebki <http://code.activestate.com/recipes/259174/>`_ dla języka pytonowskiego 2.4.

source: `Bag class <http://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
pl: `Uogólnienie Torebek <http://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ w Smalltalku.

source: Wikipedia entry for `Multisets <http://en.wikipedia.org/wiki/Multiset>`_\.
pl: Wpis na Wikipedii dla `Wielozbiorów <http://en.wikipedia.org/wiki/Multizbiór>`_\.
